import os
from dotenv import load_dotenv

load_dotenv()

TOKEN = os.getenv("API_TOKEN")

ADMIN = [os.getenv("ADMIN_R"), os.getenv("ADMIN_V")]

starthello = 'Привіт! \nТебе вітає телеграм бот РТФ, який допоможе покращити якість дисциплін на нашому факультеті.\nТрохи про правила:\n1) Всі данні потрібно заповнювати виключно українською мовою\n2) Групу потрібно вводити великими літерами, наприклад:\nРЕ-11; РЕ-п11; РЕ-11мп; РЕ-11мн;\n3) ПІБ також потрібно писати повністю, кожне слово починаючи з великої літери\n4) Якщо при проходженні опитування з‘явилась дисципліна, яку ви не проходили, будь ласка напишіть в бота наступне повідомлення:\n«Наступна дисципліна»\n\nВсі відповіді будуть аномні. Результат буде опублікований на каналі, згодом.\n\nЯщо в тебе виникнуть питання або ти знайшов помилку у боті звертайся сюди : @help_sr_bot'

qfp1 = 'Наскільки ви оцінюєте змістовність лекцій (практик), їх якість та доступність?'
qfp2 = 'Наскільки справедливим було РСО та чи відповідало воно реальності?'
qfp3 = 'На вашу думку, чи отримали ви такі знання, які знадобляться у подальшому навчанні або чи будуть вони корисними у майбутньому?'
qfp4 = "Оцінювання робіт проводилось об'єктивно? Викладач поводився адекватно?"
qfp5 = 'Чи йшов лектор\практик на зустріч стосовно прохання про пояснення завдань, проведення консультацій, тощо?'
qfp6 = 'Оцініть вміння викладача користуватись навчальними платформами.'
qfp7 = 'Наскільки своєчасно ви отримували фідбек (всі необхідні для навчання матеріали, відповіді на запитання, тощо)? (не враховуючи  воєнний стан)'
qfp8 = 'Чи ставився викладач з розумінням до особистих проблем чи обставин?'
qfp9 = 'Можете залишити своє враження\скаргу про дисципліну або людей, які її проводили.'
qfp10 = 'Маєте поради як покращити дисципліну?'